<?php

return [
    'profile_information' => 'معلومات الملف الشخصي',
    'profile_information_hint' => 'تحرير المعلومات الشخصية للمستخدم',
    'update_password' => 'تحديث كلمة المرور',
    'update_password_hint' => 'تأكد من أن حسابك يستخدم كلمة مرور عشوائية طويلة وعشوائية للبقاء آمنًا.',
    'delete_account' => 'حذف الحساب',
    'delete_account_hint' => 'بمجرد حذف حسابك، سيتم حذف جميع موارده وبياناته بشكل نهائي. قبل حذف حسابك، يرجى تنزيل أي بيانات أو معلومات ترغب في الاحتفاظ بها.',
    'delete_account_confirm' => 'بمجرد حذف حسابك، سيتم حذف جميع موارده وبياناته بشكل نهائي. يُرجى إدخال كلمة المرور الخاصة بك لتأكيد رغبتك في حذف حسابك نهائياً.',
];
